{
  "brand_story": [
    "In the high-pressure environment of college, students are forced to choose between efficiency and vitality. Typical fast food provides the speed but leaves the body depleted. Boutique health food provides the nutrients but drains the wallet and the clock.",
    "Fast&Fit resolves this conflict. We believe performance shouldn't be a trade-off. By utilizing a mobile food truck model, we bring premium, chef-driven, nutrient-dense meals directly to the heart of the campus.",
    "Our mission is simple: To provide fuel that powers late-night study sessions, early morning lectures, and active social lives without the 'fast food hangover.' We use zero processed sugars, 100% transparent sourcing, and rapid-prep techniques that respect a student's schedule."
  ],
  "logo_concepts": [
    {
      "title": "The Vibrant Shield",
      "image": "https://r2-bucket.flowith.net/f/6d0fc4eed23ddd40/fast_and_fit_logo_index_1%401024x1024.jpeg",
      "philosophy": "Focuses on the 'Fast' aspect with italics and bold green borders. It communicates reliability and peak performance energy."
    },
    {
      "title": "The Organic Bolt",
      "image": "https://r2-bucket.flowith.net/f/2bd499c78d83f962/fast_and_fit_logo_concept_index_2%401024x1024.jpeg",
      "philosophy": "Integrates the lightning bolt (Speed) into a leaf shape (Health). A perfect visual metaphor for 'Clean Energy'."
    },
    {
      "title": "Minimalist Fuel",
      "image": "https://r2-bucket.flowith.net/f/96882bd51fa0fb1d/fast_fit_logo_index_3%401024x1024.jpeg",
      "philosophy": "A clean, modern approach using negative space to imply a bowl. Targeted at the Gen Z aesthetic of simplicity and transparency."
    },
    {
      "title": "The Dynamic Duo",
      "image": "https://r2-bucket.flowith.net/f/fca29647b2378a88/fast_and_fit_logo_index_4%401024x1024.jpeg",
      "philosophy": "High-contrast typography with modern 2025 aesthetic. Uses a split-color strategy to balance the dual promise of the brand."
    }
  ]
}
